/**
 * \mainpage
 * # Лабораторна робота №12
 *
 * \author Марков Владислав, КН-922б
 * \date 27-03-2023
 */

/*!
\file main.c
\brief Головний файл

Це файл, який містить точку входу, код для запису значеннь та їх перевірки,
виклики функцій filter_arr та код виводу результату її роботи .
*/

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "lib.h"

/**
 Головна функція.

 Послідовність дій

- Створення змінних
	**matrix1 - перша матриця
	**matrix2 - друга матриця.
	**result_mul_matrix - матриця з результатом множення перших двух
	links1 - кількість строк першої матриці
	colums1 - кількість стовпців першої матриці.
	links2 - кількість строк другої матриці
	colums2 - кількість стовпців другої матриці.
	error_input - використовується як що сталося помилка при введені даних
	true_input - використовується для позначення що всі дані були введені без помилок
	leave - використовується як що користувачь хоче терміново завершити роботу програми.
	true_result - використовується для перевірки що програма була виконена або її треба виконати.
	
- Виводимо на екран інформацію про автора, номер, тему лабараторної роботи , і що виконує програма
- Створюємо цикл який дасть змогу повторити роботу програми
- Створюємо цикл для запису розмру матриць
- Як що кількість стовбців matrix1 та кількість строк matrix2 не рівні або у буфері вводу залишилися значення. Чистимо буфер та повідомляємо корстувачу що він помилився. Питаємо що він хоче зробити, як що ввів 1 то заново записати значення, як що 0 то завершити роботу програмиБ як що введе щось інше програма знову напише що вона хоче від користувача.  Як що дані були введно правильно то преходимо до іншого кроку
- Виділяємо пам'ять для наших матриць. Першие виділення виділяє кількість строк(links) друге віділяє кількість стовпців(colums)
- Створюємо цикл у якому записуємо наші дані у матриці по строках. Так само перевіряємо у буфері вводу залишилися значення чи ні. Як що вони залишилися то пишимо користувачу що він помиливсся та питаємо що він хоче зробити далі. Як що введе 1 то заново записати значення, як що 2 то змінити розмір матриці, як що 0 то терміново завершитит роботу програми. Як що дані були введено вірно то переходимо до іншого кроку.
- Перевіряємо чи були введені усі значеня вірно, як що так то виділяємо пам'ять для нашої результуючьої матриці де кільксть строк довівню кількості строк matrix1(links1) а кількість стовпців дорівнює кількості стовпців matrix2(colums2). Викликаємо функцию mul_matrix. Виводимо результат який нам повернула викликана функція. Звільнюємо пам'ять та питаємо чи хоче користувач завершити роботу програми або продовжити, 1 = продовжити, 0 = завершити.
*/

int main()
{
	char str[1000];
	long int res = 0;
	
	printf("\nАвтор:Марков Владислав\nГрупа:КН-922Б\nНомер лабараторної роботи:13\nТема:Строки (Null-terminated C Strings)\n");
	printf("Створення числа через кількість букв та чисел у строці\n\n");
	
	fgets(str,1000,stdin);
	
	res = CreateConst(str);
	
	printf("\n%ld", res);

	return 0;
}

















